Ankitha 21BTRCD004 Exp1 CSE(Data Science)

In [ ]:
import numpy as np
import pandas as pd

In [18]:
#pandas operations
#conditional selection
#access rows and col's
#add and delete columns
#concatenation merging & joining data frames
#handling missing values
#apply()

In [19]:
d={'USN':[100,101,102],
   'name':['raj','ram','hari'],
  'mobile':[99,88,77],
   'marks':[10,9,8]
  }

In [20]:
std=pd.DataFrame(d)

In [21]:
print(std)

   USN  name  mobile  marks
0  100   raj      99     10
1  101   ram      88      9
2  102  hari      77      8

In [22]:
#dataframe operations
std.head(2)
#head displays row - head
#if we pass any parameter it shows upto that row
#by default it shows all rows

   USN name  mobile  marks
0  100  raj      99     10
1  101  ram      88      9

In [23]:
std.info()
#all the info regarding the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     3 non-null      int64
 1   name    3 non-null      object
 2   mobile  3 non-null      int64
 3   marks   3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [24]:
std.columns
#return list of columns in dataframe

Index(['USN', 'name', 'mobile', 'marks'], dtype='object')

In [25]:
std.isnull()

     USN   name  mobile  marks
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

In [26]:
#accessing columns
std['USN']

0    100
1    101
2    102
Name: USN, dtype: int64

In [27]:
#accessing multiple columns we need to send the list as parameter that we need
std[['USN','name']]

   USN  name
0  100   raj
1  101   ram
2  102  hari

In [28]:
#access rows - returns row - index start from 0
#it takes row label
std.loc[2]

USN        102
name      hari
mobile      77
marks        8
Name: 2, dtype: object

In [29]:
std.iloc[2]

USN        102
name      hari
mobile      77
marks        8
Name: 2, dtype: object

In [30]:
index=['A','B','c']
std.set_index('USN')

     name  mobile  marks
USN
100   raj      99     10
101   ram      88      9
102  hari      77      8

In [31]:
std.iloc[2]

USN        102
name      hari
mobile      77
marks        8
Name: 2, dtype: object

In [ ]:
QN : Create a data frame cars with attributes car id , car name ,

In [32]:
cars={'carid':[1,2,3,4,5],
      'name':['rollsroyce','rangerover','benz','bmw','lambhorgini']
    }

In [33]:
ra=pd.DataFrame(cars)

In [34]:
ra

   carid         name
0      1   rollsroyce
1      2   rangerover
2      3         benz
3      4          bmw
4      5  lambhorgini

In [35]:
ra.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   carid   5 non-null      int64
 1   name    5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [58]:
#to prove that isnull is true
f={'USN':[100,101,102],
   'name':['raj','ram','hari'],
  'mobile':[99,88,77],
   'marks':[10,None,None]
  }

In [59]:
td=pd.DataFrame(f)

In [60]:
td

   USN  name  mobile  marks
0  100   raj      99   10.0
1  101   ram      88    NaN
2  102  hari      77    NaN

In [39]:
td.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     3 non-null      int64
 1   name    3 non-null      object
 2   mobile  3 non-null      int64
 3   marks   1 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 224.0+ bytes

In [40]:
td.isnull()

     USN   name  mobile  marks
0  False  False   False  False
1  False  False   False   True
2  False  False   False   True

In [41]:
std

   USN  name  mobile  marks
0  100   raj      99     10
1  101   ram      88      9
2  102  hari      77      8

In [42]:
#conditional selection
std['marks']<9

0    False
1    False
2     True
Name: marks, dtype: bool

In [43]:
#we will get only boolean values 
#using this to overcomme this and get the values we need to use new data frame
newdf=std['marks']<9

In [44]:
std[newdf]

   USN  name  mobile  marks
2  102  hari      77      8

In [45]:
#to get the particular attribute in the dataframe we use this
std[newdf]['name']

2    hari
Name: name, dtype: object

In [46]:
newd=std['marks']>9

In [47]:
std[newd]

   USN name  mobile  marks
0  100  raj      99     10

In [48]:
#multiple conditions
std[(std['USN']>101)|(std['marks']<40)]

   USN  name  mobile  marks
0  100   raj      99     10
1  101   ram      88      9
2  102  hari      77      8

In [49]:
std[(std['USN']>101)&(std['marks']<10)]

   USN  name  mobile  marks
2  102  hari      77      8

In [50]:
#adding new column
std

   USN  name  mobile  marks
0  100   raj      99     10
1  101   ram      88      9
2  102  hari      77      8

In [51]:
s='banglore,chennai,dmm'.split(',')
#split divides the string and makes into a list
print(s)
print(type(s))

['banglore', 'chennai', 'dmm']
<class 'list'>

In [52]:
std['Address']=s

In [53]:
std

   USN  name  mobile  marks   Address
0  100   raj      99     10  banglore
1  101   ram      88      9   chennai
2  102  hari      77      8       dmm

In [54]:
#drop will effect only on that instance
#original data will not be affected
std.drop(2)

   USN name  mobile  marks   Address
0  100  raj      99     10  banglore
1  101  ram      88      9   chennai

In [61]:
d2={'USN':[None,101,102],
   'name':[None,None,'hari'],
  'mobile':[99,88,77],
   'marks':[35,33,None]
  }

In [62]:
df=pd.DataFrame(d2)

In [63]:
df

     USN  name  mobile  marks
0    NaN  None      99   35.0
1  101.0  None      88   33.0
2  102.0  hari      77    NaN